hermeneus.org
# -*- mode: org; org-src-preserve-indentation: t; org-blank-before-new-entry: '((heading . t) (plain-list-item . auto)); eval: (progn (when (fboundp 'tina/org-insert-heading-after) (add-hook 'org-insert-heading-hook 'tina/org-insert-heading-after t t)) (when (and (fboundp 'tina/org-add-end-matter) (fboundp 'tina/org-babel-tangle-add-end-matter)) (add-hook 'org-babel-pre-tangle-hook 'tina/org-babel-tangle-add-end-matter nil t))) -*-

#+TITLE: Hermeneus

#+PROPERTY: header-args :results silent :tangle yes
#+PROPERTY: header-args:emacs-lisp :lexical t

* Early definitions

** Front matter
#+begin_src emacs-lisp
;;; hermeneus.el --- Ancient Greek word lookup tool -*- lexical-binding: t -*-
#+end_src

** Package header
#+begin_src emacs-lisp
;; Author: Tina Russell
;; Maintainer: Tina Russell
;; Version: 0.1
;; Package-Requires: ((emacs "25.1") (anaphora "1.0.4"))
;; Homepage: https://github.com/TinaRussell/hermeneus
;; Keywords: greek language reference


;; This file is not part of GNU Emacs

;; This file is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; For a full copy of the GNU General Public License
;; see <http://www.gnu.org/licenses/>.


;;; Commentary:

;; This is Hermeneus, the Ancient Greek word system and lookup tool.
;; Once this package is loaded, use the command ‘describe-greek-word’
;; to look up a word in Ancient Greek. The ‘ivy’ package is
;; recommended (see option ‘hermeneus-use-ivy’).

;;; Code:
#+end_src

** Dependencies
:PROPERTIES:
:ID:       TKR:b4c7fe07-d157-4832-94c7-2be9bf65d6d9
:END:
#+begin_src emacs-lisp
(require 'eieio-core)
(require 'cl-preloaded)
(require 'eieio)
(require 'custom)
(require 'derived)

(eval-when-compile (require 'subr-x)
                   (require 'rx)
                   (require 'cl-macs))
#+end_src

** Constants
:PROPERTIES:
:ID:       TKR:476d569a-11f6-4c85-9c83-286ab6af8fec
:END:
#+begin_src emacs-lisp
(defconst hermeneus--greek-letters "αβγδεϝζηθιϳκλμνξοπρςτυφχψωΑΒΓΔΕϜΖΗΘΙͿΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ"
  "Every letter in the Greek alphabet, including the digamma and yot.")

(defconst hermeneus--greek-diacritics "\u0313\u0314\u0300\u0301\u0342\u0308\u0345\u0304\u0306"
  "Every combining diacritic relevant to Ancient Greek.")

(defconst hermeneus--greek-punctuation "’·;")

;; This isn’t actually used anywhere. I don’t remember why I made it.
;; But it’s nice, so it stays.
(defconst hermeneus--greek-letter-names
  (list "alpha"  "beta"   "gamma" "delta" "epsilon" "digamma" "zeta"
          "eta" "theta"    "iota"   "yot"   "kappa"  "lambda"   "mu"
           "nu"    "xi" "omicron"    "pi"     "rho"   "sigma"  "tau"
      "upsilon"   "phi"     "chi"   "psi"   "omega"))

(defconst hermeneus--greek-unicode-all
  (cl-loop for v being the hash-values of (ucs-names)
           for v = (char-to-string v)
           if (string-match-p (rx (category greek)) v)
           concat v))

(defconst hermeneus--lowercase-sigmas "σςϲͻͼͽ")
(defconst hermeneus--uppercase-sigmas "ΣϹϽϾϿ")

(defconst hermeneus--all-sigmas (concat hermeneus--lowercase-sigmas
                                  hermeneus--uppercase-sigmas)
  "Every sigma. All of them.
You need a lowercase word-ending sigma? Consider it done. How
about a capital reverse dotted lunate sigma? We’ve got you
covered. Is this madness, you ask? Madness? THIS IS SIGMA!")

(defconst hermeneus--git-lsj-dir
  "https://raw.githubusercontent.com/PerseusDL/lexica/master/CTS_XML_TEI/perseus/pdllex/grc/lsj/"
  "Location of the LSJ within the PerseusDL “lexica” repository.")
#+end_src

** Utility functions
:PROPERTIES:
:ID:       TKR:033a6ce1-0d17-431f-921d-75c4ed9bd8d9
:END:
#+begin_src emacs-lisp
(defun hermeneus-alist-to-local-vars (alist &optional prefix)
  "Convert each key in alist ALIST to a local variable.
Each variable will have the name and value of the relevant key.
If PREFIX is a string, it will be added to the beginning of each
variable name (with a hyphen in between)."
  (let (rtn)
    (dolist (a alist (nreverse rtn))
      (let* ((var-sym (if (stringp prefix)
                          (intern (concat prefix "-" (symbol-name (car a))))
                        (car a)))
             (var (make-local-variable var-sym)))
        (set var (cdr a))
        (push var rtn)))))

(defun hermeneus--make-keyword (symbol)
  "Make a keyword with the same name as SYMBOL (but with a colon)."
  (make-symbol (concat ":" (symbol-name symbol))))
#+end_src

*** Get default value of class slot
:PROPERTIES:
:ID:       TKR:48d94516-5ea7-456d-b072-2666f4600d71
:END:
#+begin_src emacs-lisp
(defun hermeneus--get-slot-default-value (class slot)
  "Return the default value of SLOT in CLASS.
SLOT should be given as a symbol. Signals an error if CLASS does
not contain a slot named SLOT."
  (if-let ((slot-actual
            (cl-loop for s in (eieio-class-slots class)
                     if (eq (cl--slot-descriptor-name s) slot)
                     return s)))
      (thread-first slot-actual
        (cl--slot-descriptor-initform)
        (eieio-default-eval-maybe))
    (error "Class %s does not appear to contain slot ‘%s’" class slot)))
#+end_src

*** Which words have combining diacriticals that won’t… combine?
#+begin_src emacs-lisp :tangle no :results replace list :load no
(let (current-word)
  (cl-loop for i across (seq-copy hermeneus-greek-words-beta)
           if (string-match-p (rx (category combining-diacritic)) (setq current-word (hermeneus-beta-to-unicode i)))
           collect (message "%s ⇒ %s" i current-word)))
#+end_src

#+RESULTS:
- a)qw/|/wsis ⇒ ἀθῴ́ωσις
- *)ai/+das ⇒ ἈΪ́Δας
- *)ai/+dhs ⇒ ἈΪ́Δης
- a)lh/(ion ⇒ ἀλή̔ιον
- a)mfiqrw/|/skw ⇒ ἀμφιθρῴ́σκω
- a)natru\/ga/w ⇒ ἀνατρὺ́γάω
- a)nd=i/kths ⇒ ἀνδ͂ίκτης
- da+mosiofu/lakes ⇒ δα̈μοσιοφύλακες
- dafno=ghqh/s ⇒ δαφνο͂γηθής
- e)nagro/meno|s ⇒ ἐναγρόμενοͅς
- e)noiko=dome/w ⇒ ἐνοικο͂δομέω
- e)u)+krhmnos ⇒ ἐὐ̈κρημνος
- *)ia=puc ⇒ ἸΑ͂Πυξ
- polupu\/los ⇒ πολυπὺ́λος
- *)ra=ros ⇒ Ρ̓Α͂Ρος
- *)ra/rion ⇒ Ρ̓ΆΡιον
- w)|o=fage/w ⇒ ᾠο͂φαγέω

*** Trim a string
#+begin_src emacs-lisp
(defun hermeneus--trim-string-extra (string)
  "Trim a string more aggressively than the function ‘string-trim’.
Returns STRING, with whitespace and punctuation characters found
at each end removed."
  (let ((trim (rx (one-or-more (any blank punctuation ?\n)))))
    (string-trim string trim trim)))
#+end_src

** Options
:PROPERTIES:
:ID:       TKR:feba7f56-ff49-4ed3-9db0-f6602296810a
:END:
#+begin_src emacs-lisp
(defgroup hermeneus nil
  "Options for Hermeneus, the Ancient Greek word utility."
  :tag "Hermeneus"
  :group 'applications
  :prefix "hermeneus-")

(defgroup hermeneus-faces nil
  "Faces used in Hermeneus, the Ancient Greek word utility."
  :tag "Hermeneus faces"
  :group 'hermeneus)
#+end_src

*** Hooks
:PROPERTIES:
:ID:       TKR:d47a2a83-a109-4534-927f-b93831bb9cbe
:END:
#+begin_src emacs-lisp
(defcustom hermeneus-scan-entry-functions nil
  "Functions called by ‘hermeneus-scan-xml’ for every XML element
in the lexicon. Each function is run with two arguments: the
word-object corresponding to the entry, and the DOM parsed
from the XML element itself."
  :type 'hook
  :group 'hermeneus)
#+end_src

** Modes
:PROPERTIES:
:ID:       TKR:e540ec29-199d-4eaa-86e5-fb355dd51938
:END:
#+begin_src emacs-lisp
(define-derived-mode hermeneus-mode special-mode "Hermeneus")
#+end_src

** Keys
:PROPERTIES:
:ID:       TKR:057b84a7-d596-45d7-ab34-ce9b509049a7
:END:
#+begin_src emacs-lisp
(define-key hermeneus-mode-map "g" 'hermeneus-buffer-update)
#+end_src

** Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
;;; hermeneus-test.el --- Tests for Hermeneus -*- lexical-binding: t -*-
#+end_src

* Conversion
:PROPERTIES:
:ID:       TKR:a5c757b2-ff0f-4c62-957d-8d8dc8da62a1
:header-args:emacs-lisp: :tangle hermeneus-conv.el
:END:
This section exists for converting Latin letters representing Greek letters (i.e. “Beta code”) into proper, godly Greek Unicode characters.

Now, Beta code, as it exists in this program, takes two forms: the standard Beta code used by the XML LSJ, and a more personalized Beta code for the individual user. The latter mainly exists because I wanted to be able to look up Greek words in a Greek keyboard layout without having to switch from a QWERTY layout manually; but, I realized that this approach (translating the QWERTY layout to the Greek layout) excludes those who use different keyboard layouts, which is why I made it fully customizable. (see option ~hermeneus-beta-input-type~) It’s a bit of a doozy to implement, requiring several utility functions and a loop in a custom setter function, but well worth it for increasing the international utility of Hermeneus.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-conv.el --- -*- lexical-binding: t -*-
#+end_src

** Dependencies
:PROPERTIES:
:ID:       TKR:91c60345-0a80-4c03-8984-9a02ff01186d
:END:
#+begin_src emacs-lisp
(require 'cl-lib)
(require 'ucs-normalize)

(eval-when-compile
  (require 'rx)
  (require 'cl-macs)
  (require 'subr-x))

(defvar hermeneus--greek-letters)
(defvar hermeneus--greek-punctuation)
(defvar hermeneus--greek-diacritics)
(defvar hermeneus--all-sigmas)
(defvar hermeneus-beta-input-type)
(defvar hermeneus--beta-letters-user)
#+end_src

