hermeneus.org
** Utility functions
#+begin_src emacs-lisp
(defun hermeneus--regexp-bracket-quote (string)
  "Return STRING, regexp-quoted and, if necessary, in square brackets.
This exists for when a regexp being generated may need to match
one character or more than one character, depending on the length
of input STRING."
  (if (> (length string) 1)
      (concat "[" (regexp-quote string) "]")
    (regexp-quote string)))
#+end_src

** Macros
#+begin_src emacs-lisp
(defmacro hermeneus--make-regexp-versions (def-form &rest string-vars)
  "Define regexp versions of a series of string variables.
Each string in STRING-VARS will be given a regexp version, suffixed
\"regexp\", which will match any character in the string.
DEF-FORM should be one of ‘defvar’, ‘defconst’, or ‘setq’."
  (declare (indent 1)
           (debug ([&or "defvar" "defconst" "setq"] &rest symbolp)))
  `(progn
     ,@(cl-loop for var in string-vars
              collect (list def-form (intern (concat (symbol-name var) "-regexp"))
                            (hermeneus--regexp-bracket-quote (symbol-value var))))))
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:c056d1e0-5c34-41de-89de-94d388c5285f
:END:
#+begin_src emacs-lisp
;; For comparison, here is ‘hermeneus--greek-letters’:
;; αβγδεϝζηθιϳκλμνξοπρςτυφχψωΑΒΓΔΕϜΖΗΘΙͿΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ
(defconst hermeneus--beta-letters--standard
  "abgdevzhqijklmncoprstufxywABGDEVZHQIJKLMNCOPRSTUFXYW")

(defvar hermeneus--beta-letters--user hermeneus--beta-letters--standard)

;; (defconst hermeneus--greek-kbd-letters
;;   "abgde`zhuiĳklmnjoprwtyfxcvABGDE~ZHUIĲKLMNJOPRWTYFXCV")

;; (defvar hermeneus--beta-letters--user hermeneus--beta-letters--standard)
;; (defvar hermeneus--beta-output-letters hermeneus--greek-letters)

;; For comparison, here are the non-combining versions of the
;; characters in ‘hermeneus--greek-diacritics’:
;; ᾿῾ `´῀¨ͺˉ˘
(defconst hermeneus--beta-diacritics
  ")(\\/=+|_^")

(defconst hermeneus--beta-punctuation
  "':;") ; "’·;"

(defconst hermeneus--beta-all--standard
  (concat hermeneus--beta-punctuation hermeneus--beta-diacritics hermeneus--beta-letters--standard))

(hermeneus--make-regexp-versions defconst
  hermeneus--beta-diacritics hermeneus--beta-punctuation
  hermeneus--beta-all--standard)

(defvar hermeneus--beta-all--user hermeneus--beta-all--standard)
(defvar hermeneus--beta-all--user-regexp
  (hermeneus--regexp-bracket-quote hermeneus--beta-all--user))

(defvar hermeneus--greek-all
  (concat hermeneus--greek-punctuation hermeneus--greek-diacritics
          (apply #'string
                 (delete-dups (append (string-to-list hermeneus--greek-letters)
                                      (string-to-list hermeneus--all-sigmas))))))
#+end_src

