hermeneus.org
** Normalize diacritics
#+begin_src emacs-lisp
(defun hermeneus-conv--change-diacritics-placement (string)
  (let ((rx (rx (group "*")
                (group (one-or-more (any ")(/\\=+|—^")))
                (group letter))))
    (replace-regexp-in-string rx "\\1\\3\\2" string)))

(defun hermeneus-conv--dieresis-before-accent (string)
  (let ((rx (rx (group (any "/\\"))
                (group "+" ))))
    (replace-regexp-in-string rx "\\2\\1" string)))

(defun hermeneus-conv--capitalize-after-asterisk (string)
  "If STRING contains an asterisk, return STRING with no asterisk
and with the first letter after it capitalized. Otherwise, return
STRING. (This also happens when no letters appear anywhere
following the asterisk.)"
  (if-let ((astr-idx (string-match-p "\*" string))   ; “asterisk index”
           (capt-idx (string-match-p (rx word-start) ; where to capitalize
                                     string (1+ astr-idx))))
      (progn (setq string (concat (substring string 0 astr-idx)
                                  (substring string (1+ astr-idx) capt-idx)
                                  (char-to-string (upcase (elt string capt-idx)))
                                  (substring string (1+ capt-idx))))
             (hermeneus-conv--capitalize-after-asterisk string))
    string))

(defun hermeneus-conv--normalize-beta-diacritics (string)
  (thread-first string
    (hermeneus-conv--change-diacritics-placement)
    (hermeneus-conv--dieresis-before-accent)
    (hermeneus-conv--capitalize-after-asterisk)))
#+end_src

** Normalize sigmas
#+begin_src emacs-lisp
(defun hermeneus-conv--normalize-sigmas (string)
  "Returns a copy of STRING, but with sigmas normalized.
Sigmas which end a word will be replaced with “ς”, while other sigmas
will be replaced with “σ”."
  ;; This function used to look like this:
  ;;
  ;; (replace-regexp-in-string (rx "ς" (not word-boundary)) "σ" string))
  ;;
  ;; An elaborate rewrite was necessary because Emacs’s regexp engine
  ;; now sees “σ” and “ς” as equivalent, which confuses the hell out
  ;; of ‘replace-regexp-in-string’.
  (let ((max (length string))
        done i substrings sigma)
    (while (not done)
      (if-let ((sigma-idx (string-match-p "ς" string i)) ; the actual test
               (next-idx (1+ sigma-idx))
               (new-substring (substring string (or i 0) sigma-idx)))
          ;; sigma is present
          (progn
            (setq sigma
                  ;; does it end a word?
                  (if (or (and (eq next-idx max) (setq done t))
                          (not (eq (char-syntax (elt string next-idx)) ?w)))
                      "ς" ; yes
                    "σ")) ; no
            (setq substrings
                  (cons sigma (cons new-substring substrings)))
            (setq i next-idx))
        ;; no more sigmas
        (if (not i) ; ‘i’ will be nil if the string had no sigmas at all
            (setq done string)
          (push (substring string i max) substrings)
          (setq done t))))
    (if (stringp done)
        done
      (apply #'concat (nreverse substrings)))))
#+end_src

** Conversion
#+begin_src emacs-lisp
(defun hermeneus-beta-to-unicode (string &optional input-p match-p)
  "Return STRING converted from Beta code to Unicode.
INPUT-P is whether or not the string should be interpreted as
user input. (The difference is that user input should be read
according to the option ‘hermeneus-conv-beta-input-type’; otherwise, it
should be read as standard Beta code, as used in the XML LSJ.)
MATCH-P should be non-nil when converting a string to be used
solely for matching (like in the function ‘hermeneus--re-builder’), in
which case sigma normalization is unnecessary."
  (setq string
        (thread-first string
          (hermeneus-conv--normalize-beta-diacritics)
          (hermeneus--convert-string-by-hash (if input-p
                                           hermeneus--beta-hash--user
                                         hermeneus--beta-hash--standard))
          (ucs-normalize-NFC-string)))
  (if match-p
      string
    (hermeneus-conv--normalize-sigmas string)))
#+end_src

** Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
(ert-deftest conv-test "Test Beta to Unicode conversion"
  (should (equal (hermeneus-beta-to-unicode "*)odusseu/s") "Ὀδυσσεύς"))
  (should (let ((hermeneus-beta-input-type 'greek-kbd))
            (hermeneus-conv--set-beta-input-type)
            (equal (hermeneus-beta-to-unicode "*)odyssey/w" t) "Ὀδυσσεύς")))
  (should (let ((hermeneus-beta-input-type '("o" "d" "y" "b" "z" "`"  "e" "s" "w" "i" "ĳ" "k" "l" "m"
                                       "n" "j" "a" "p" "r" "hu" "t" "g" "f" "x" "c" "v"
                                       "O" "D" "Y" "B" "Z" "~"  "E" "S" "W" "I" "Ĳ" "K" "L" "M"
                                       "N" "J" "A" "P" "R" "HU" "T" "G" "F" "X" "C" "V")))
            (hermeneus-conv--set-beta-input-type)
            (equal (hermeneus-beta-to-unicode "*)abghhzg/u" t) "Ὀδυσσεύς"))))
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:843a4901-0bf6-4c9e-a709-c79b0a4195bc
:END:
#+begin_src emacs-lisp
(provide 'hermeneus-conv)

;;; hermeneus-conv.el ends here
#+end_src

* Matching
:PROPERTIES:
:header-args:emacs-lisp: :tangle hermeneus-match.el
:END:
Here we have everything to do with matching one string to another. This is mainly used for completion, so performance is critical.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-match.el --- -*- lexical-binding: t -*-
#+end_src

** Dependencies
#+begin_src emacs-lisp
(require 'ucs-normalize)

(eval-when-compile (require 'rx)
                   (require 'cl-macs)
                   (require 'subr-x))

(require 'hermeneus-conv)

(defvar hermeneus--greek-punctuation)
#+end_src

** Variables
#+begin_src emacs-lisp
(hermeneus--make-regexp-versions defconst
  hermeneus--lowercase-sigmas hermeneus--uppercase-sigmas hermeneus--all-sigmas)
#+end_src

** Functions

*** Remove diacritics from Greek words
:PROPERTIES:
:ID:       TKR:36e58a64-4ada-426c-b9b8-cd7d76123bb2
:END:
#+begin_src emacs-lisp
(defun hermeneus-remove-diacritics (string)
  "Return STRING, but with all diacritics removed."
  (replace-regexp-in-string (rx (category combining-diacritic)) ""
                            (ucs-normalize-NFD-string string)))
#+end_src

