hermeneus-match.el
;;; hermeneus-match.el --- -*- lexical-binding: t -*-

(require 'ucs-normalize)

(eval-when-compile (require 'rx)
                   (require 'cl-macs)
                   (require 'subr-x))

(require 'hermeneus-conv)

(defvar hermeneus--greek-punctuation)

(hermeneus--make-regexp-versions defconst
  hermeneus--lowercase-sigmas hermeneus--uppercase-sigmas hermeneus--all-sigmas)

(defun hermeneus-remove-diacritics (string)
  "Return STRING, but with all diacritics removed."
  (replace-regexp-in-string (rx (category combining-diacritic)) ""
                            (ucs-normalize-NFD-string string)))
