hermeneus.org
** Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
(ert-deftest match-test ()
  "Test the results of the regexp matcher."
  ;; This is the sexp used to create ‘wordlist’:
  ;; (cl-loop for string in (hash-table-keys (oref hermeneus-lsj entries)) if (string-match-p (hermeneus--re-builder "αφρο") string) collect string)
  (should (let ((wordlist '("ἀκαταφρόνητος" "ἀναφροδισία"
                            "ἀναφρόδιτος" "ἀναφρονέω" "ἀναφροντίζω"
                            "ἄναφρος" "ἀνεπαφροδισία" "ἀνεπαφρόδιτος"
                            "ἀντικαταφρονέω" "ἀξιοκαταφρόνητος"
                            "ἀφρόγαλα" "ἀφρογένεια" "Ἀφροδίσια"
                            "Ἀφροδισιάζω" "Ἀφροδισιακός" "Ἀφροδισιάς"
                            "Ἀφροδισιασμός" "Ἀφροδισιαστής"
                            "Ἀφροδισιαστικός" "Ἀφροδίσιος"
                            "Ἀφροδισιών" "Ἀφροδιταρίδιον"
                            "Ἀφροδιτάριον" "Ἀφροδίτη" "ἀφρόκομος"
                            "ἀφρόλιτρον" "ἀφρονεύομαι" "ἀφρόνευσις"
                            "ἀφρονέω" "ἀφρόνη" "ἀφρόνησις" "ἀφρονίζω"
                            "ἀφρονικός" "ἀφρόνιτρον" "ἄφροντις"
                            "ἀφροντιστέω" "ἀφροντιστητέον"
                            "ἀφροντιστί" "ἀφροντιστία" "ἀφρόντιστος"
                            "ἀφρόομαι" "ἀφρός" "ἀφροσέληνος"
                            "ἀφροσιβόμβαξ" "ἀφρόσκορδον" "ἀφροσύνη"
                            "ἀφροτόκος" "ἀφρουρέω" "ἀφρούρητος"
                            "ἄφρουρος" "ἀφροφυής" "δειλοκαταφρονητής"
                            "διαφρονέω" "διαφροντίζω" "διαφρος"
                            "διαφρουρέω" "δυσκαταφρόνητος"
                            "ἐλαφρόγειος" "ἐλαφρόνοος" "ἐλαφρός"
                            "ἐλαφρότης" "ἐλαφροτοκία" "ἐλαφρόω"
                            "ἐναφροδισιάζω" "ἐξαφρόομαι" "ἐπαφροδισία"
                            "ἐπαφρόδιτος" "ἔπαφρος" "Ἑρμαφρόδιτος"
                            "εὐαφρόδιτος" "εὐκαταφρόνητος"
                            "εὐκαταφρόντιστος" "καταφρονέω"
                            "καταφρόνημα" "καταφρόνησις"
                            "καταφρονητέον" "καταφρονητής"
                            "καταφρονητικός" "καταφρόνητος"
                            "καταφροντίζω" "Κουραφροδίτη" "ναφρόν"
                            "πανεπαφροδισία" "παραφρονέω" "παραφρονία"
                            "παραφρόνιμος" "παραφροσύνη" "παραφρουρέω"
                            "προσκαταφρονέω" "ταφροβολέω" "ταφροειδής"
                            "ταφροποιέω" "τάφρος" "ὕπαφρος"
                            "ὑπελαφρός" "ὑπερέλαφρος"
                            "ὑποκαταφρονέω"))
                (regexp (hermeneus--re-builder "Αφροδ"))
                (expected-result '("Ἀφροδίσια" "Ἀφροδισιάζω"
                                   "Ἀφροδισιακός" "Ἀφροδισιάς"
                                   "Ἀφροδισιασμός" "Ἀφροδισιαστής"
                                   "Ἀφροδισιαστικός" "Ἀφροδίσιος"
                                   "Ἀφροδισιών" "Ἀφροδιταρίδιον"
                                   "Ἀφροδιτάριον" "Ἀφροδίτη"
                                   "ἀναφροδισία" "ἀναφρόδιτος"
                                   "ἀνεπαφροδισία" "ἀνεπαφρόδιτος"
                                   "ἐναφροδισιάζω" "ἐπαφροδισία"
                                   "ἐπαφρόδιτος" "Ἑρμαφρόδιτος"
                                   "εὐαφρόδιτος" "Κουραφροδίτη"
                                   "πανεπαφροδισία"))
                (case-fold-search t))
            (equal (hermeneus--re-matcher regexp wordlist)
                   expected-result))))
#+end_src

** End matter
#+begin_src emacs-lisp
(provide 'hermeneus-match)

;;; hermeneus-match.el ends here
#+end_src

* Storage
:PROPERTIES:
:ID:       TKR:517f86fc-db04-4e9d-8539-6111477bea54
:header-args:emacs-lisp: :tangle hermeneus-storage.el
:END:
This section contains the ~hermeneus-word~ and ~hermeneus-lexicon~ objects, used for storing the results of ~hermeneus-scan-lsj~ (see [[XML]]). ~hermeneus-lexicon~ uses ~eieio-persistent~ to store the data long-term.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-storage.el --- -*- lexical-binding: t -*-
#+end_src

** Dependencies
:PROPERTIES:
:ID:       TKR:76751cd5-569d-483b-a6e0-2050e9760bd7
:END:
#+begin_src emacs-lisp
(require 'eieio)
(require 'eieio-base)
(require 'cl-generic)

(declare-function #'hermeneus-scan-entries "hermeneus-xml")
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:cc2d39d7-8b0f-4f8c-adfb-0d5e8d715cfd
:END:
#+begin_src emacs-lisp
(defvar hermeneus-storage-file (concat "lsj-cache" (when (executable-find "gzip") ".gz")))
(defvar hermeneus-storage-path nil) ; this is set by the setter function below

(defcustom hermeneus-storage-dir (expand-file-name "var/hermeneus" user-emacs-directory)
  "Directory in which to store files generated by Hermeneus.
At present, this means where to store the Hermeneus lexicon
cache. If you set this outside Customize, ensure that the
directory exists (creating it if necessary), and set
‘hermeneus-storage-path’ to the value returned by calling
‘expand-file-name’ with two arguments: the current value of
‘hermeneus-storage-file’, and the new value for ‘hermeneus-storage-dir’."
  :type 'directory
  :tag "Hermeneus — storage directory"
  :group 'hermeneus
  :set (lambda (symbol value)
         (unless (file-exists-p (directory-file-name value))
           (make-directory (directory-file-name value) t))
         (set-default symbol value)
         (setq hermeneus-storage-path
               (expand-file-name hermeneus-storage-file value))))
#+end_src

** Objects
:PROPERTIES:
:ID:       TKR:ec258183-0deb-4581-a0df-7ad3eec2dcd8
:END:
#+begin_src emacs-lisp
(defclass hermeneus-word ()
  ((key :type string
        :initarg :key
        :initform "")
   (id :type integer
       :initarg :id
       :initform 0)
   (loc :type (or cons null)
        :initarg :loc
        :initform nil))
  :documentation "A Hermeneus object to represent one word.")

(defclass hermeneus-lexicon (eieio-persistent)
  ((initialized-p :type boolean
                  :initarg :initialized-p
                  :initform nil)
   (entries :type hash-table
            :initarg :entries
            :initform (make-hash-table :size 116493 :test 'equal))
   ;; I have absolutely zero clue why (file :initform hermeneus-storage-path)
   ;; results in an “invalid-slot-type” error, but this doesn’t:
   (file :initform (symbol-value 'hermeneus-storage-path))
   (file-header-line :initform ";; Hermeneus lexicon object"))
  :documentation "A Hermeneus object to represent a lexicon of words.
Use the function ‘hermeneus-get-entries’ to access the ‘entries’ slot.")
#+end_src

** Methods
:PROPERTIES:
:ID:       TKR:155090bb-4267-4ec2-be28-e402000a0a0e
:END:
#+begin_src emacs-lisp
(cl-defmethod make-instance ((cls (subclass hermeneus-lexicon)) &rest slots)
  "When making a ‘hermeneus-lexicon’ object, try to read it from a file.
(The file’s path can be passed as a “:file” keyword argument, but
otherwise defaults to ‘hermeneus-storage-path’.) If the file doesn’t exist,
or otherwise can’t be used, move on."
  (let ((path (or (plist-get slots :file)
                  hermeneus-storage-path)))
    (or (and (file-exists-p path)
             (eieio-persistent-read path cls t))
        (cl-call-next-method))))

(defvar hermeneus-lsj (hermeneus-lexicon nil))
#+end_src

** TODO Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:bdfa271e-9060-4205-bd28-d168aef150d2
:END:
#+begin_src emacs-lisp
(provide 'hermeneus-storage)

;;; hermeneus-storage.el ends here
#+end_src

* XML
:PROPERTIES:
:header-args:emacs-lisp: :tangle hermeneus-xml.el
:END:
This section has everything to do with parsing XML, specifically, [[https://github.com/PerseusDL/lexica][the XML version of the Liddell-Scott-Jones /Greek-English Lexicon]]/ (“the LSJ”), scanned and exhaustively tagged by the fine folks at the Perseus Project.

The main function here is ~hermeneus-scan-lsj~ (in [[Scan the LSJ]]), which parses the entire LSJ, creates a word object (see [[id:TKR:ec258183-0deb-4581-a0df-7ad3eec2dcd8][Objects]] over in [[Storage]]) for each entry, and stores the word objects in the lexicon object ~hermeneus-lsj~. (Within the lexicon object, the words are stored in a hash table for speedy access.)

If you’d like, you can write a function (whose arguments are a word-object and its XML entry’s DOM) and add it to the hook ~hermeneus-scan-entry-functions~ (see [[id:TKR:d47a2a83-a109-4534-927f-b93831bb9cbe][Hooks]] in [[Early definitions]]), and the function will be run with every word scanned. You can use this, for instance, to modify the object based on information found in the entry.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-xml.el --- -*- lexical-binding: t -*-
#+end_src

