hermeneus.org
** Access/populate ~entries~ slot of hermeneus-lexicon object

#+begin_src emacs-lisp
(defun hermeneus-get-entries (lexicon)
  "Access ‘entries’ slot of ‘hermeneus-lexicon’ object LEXICON.
The ‘entries’ slot of ‘hermeneus-lexicon’ objects is a hash table
containing ‘hermeneus-word’ objects. The reason to use this function
instead of using (oref LEXICON entries) is because a newly
created ‘hermeneus-lexicon’ object will not have any ‘hermeneus-word’ objects
in its ‘entries’ slot, and will need to be populated."
  (unless (hermeneus-lexicon-p lexicon)
    (signal 'wrong-type-argument (list 'hermeneus-lexicon-p lexicon)))
  (unless (oref lexicon initialized-p)
    (hermeneus--populate-lexicon lexicon))
  (oref lexicon entries))

(defun hermeneus--populate-lexicon (lexicon)
  "Populate the ‘entries’ hash-table of ‘hermeneus-lexicon’ object LEXICON
with word-objects from the LSJ."
  (oset lexicon entries (hermeneus-scan-entries))
  (oset lexicon initialized-p t)
  (eieio-persistent-save lexicon))

;;;###autoload
(defun hermeneus-scan-lsj ()
  "Scan the LSJ and save the resulting word-objects to ‘hermeneus-lsj’."
  (interactive)
  (hermeneus--populate-lexicon hermeneus-lsj))
#+end_src

** Return all tag types found in the LSJ (for reference; does not tangle)
This code doesn’t work well. If you can tell, I’ve made many attempts to avoid and make note of entries that make the function choke. Still, it always causes hermeneus-scan-entries to hang somewhere at about 39%. But, the results (see below) /should/ be a complete list of every tag used in the LSJ.

#+begin_src emacs-lisp :tangle no :results replace list :load no
(defvar hermeneus--all-tag-types nil)
(defvar hermeneus--current-entry nil)
(defvar hermeneus--current-children nil)
(defvar hermeneus--tricky-bastards nil)

(defun hermeneus--get-tag-types (_obj dom)
  (setq hermeneus--tricky-bastards nil)
  (awhen (dom-attr dom 'key)
    (setq hermeneus--current-entry it)
    (setq hermeneus--current-children (dom-children dom)))
  (let ((tags nil)
        (children (dom-children dom)))
    ;;    (when (equal (dom-attr dom 'key) "ei)/dw1")
    ;;      (setq please-have-mercy-on-me children))
    (cl-loop for elt in children
             if (not (stringp elt))
             do (prog1 (cl-pushnew (symbol-name (dom-tag elt)) hermeneus--all-tag-types)
                  (if (> (length children) 32)
                      (push elt hermeneus--tricky-bastards)
                    (hermeneus--get-tag-types _obj children))))))

(add-hook 'hermeneus-scan-entry-functions 'hermeneus--get-tag-types)

(reverse hermeneus--all-tag-types)
#+end_src

#+RESULTS:
- orth
- gen
- itype
- sense
- foreign
- bibl
- title
- etym
- pron
- gramGrp
- abbr
- tns
- pos
- date
- placeName
- per
- number
- mood
- name
- pb
- subc
- cit
- tr

** TODO Testing

#+begin_src emacs-lisp :tangle "hermeneus-test.el"
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:327d7216-5a65-4f76-b9fd-c2a2742c0ada
:END:
#+begin_src emacs-lisp
(provide 'hermeneus-xml)

;;; hermeneus-xml.el ends here
#+end_src

* Completion
:PROPERTIES:
:ID:       TKR:49f3f037-acfd-414f-bc51-0a963faa0352
:header-args:emacs-lisp: :tangle hermeneus-completion.el
:END:
This section handles completion (via ~completing-read~ or Ivy) and contains functions for looking up words.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-completion.el --- -*- lexical-binding: t -*-
#+end_src

** Dependencies
:PROPERTIES:
:ID:       TKR:a33012b6-462c-44fd-b63f-65f07969227c
:END:
#+begin_src emacs-lisp
(require 'cl-extra)
(require 'custom)
(require 'eieio)
(require 'ucs-normalize)
(require 'rx)

(eval-when-compile (require 'cl-macs)
                   (require 'subr-x))

(require 'hermeneus-conv)
(require 'hermeneus-match)
(require 'hermeneus-xml)

(defvar hermeneus--greek-punctuation)
#+end_src

** Variables
:PROPERTIES:
:ID:       TKR:7f0bab31-c461-44f0-898d-a80deeefd174
:END:
#+begin_src emacs-lisp
(defcustom hermeneus-use-ivy (let ((libs '(ivy counsel)))
                         (or (cl-every 'featurep libs)
                             (cl-every 'package-installed-p libs)))
  "Whether to use the ‘ivy’ package for ‘describe-greek-word’.
This allows two important features. The first is matching by Beta
code: if you type in Beta code (e.g. “i(ero/doulos” instead of
“ἱερόδουλος”), it will match as though you typed the Greek
Unicode equivalent. (See option ‘hermeneus-beta-input-type’ if you want
to customize the type of Beta code used for this.) The second is
diacritic-agnostic matching: if you type Greek with no diacritics
into the ‘describe-greek-word’ prompt, it will match any
combination of diacritics on the same sequence of letters. This
works whether you’re typing in Greek Unicode or in Beta code: so,
either “etaira” or “εταιρα” will match “ἑταίρα”.

This option has no effect if Ivy is not installed. If Ivy is
installed, but this option is turned off (‘nil’), then the Ivy
version of ‘describe-greek-word’ is still available as the
command ‘counsel-greek-word’."
  :type 'boolean
  :group 'hermeneus)
#+end_src

** Describe Greek word
:PROPERTIES:
:ID:       TKR:4864efa6-7652-4504-b780-f06f24283984
:END:
#+begin_src emacs-lisp
;;;###autoload
(defun describe-greek-word (word)
  (interactive
   (list
    (let ((entries (hermeneus-get-entries hermeneus-lsj)))
      (if (and hermeneus-use-ivy (fboundp 'ivy-read))
          (counsel-greek-word "Look up Greek word: " hermeneus-lsj)
        (let ((default (hermeneus-greek-word-at-point)))
          (completing-read (format "Look up Greek word%s: "
                                   (if default
                                       (format " (default: %s)" default)
                                     ""))
                           entries nil t nil nil default))))))
  (unless (and hermeneus-use-ivy (fboundp 'ivy-read))
    (hermeneus--display-word-buffer word)))
#+end_src

** Read word
:PROPERTIES:
:ID:       TKR:e488b337-55e7-4543-ae83-dfdedc268b8c
:END:
#+begin_src emacs-lisp
(cl-defun counsel-greek-word (&optional (prompt "Look up Greek word:")
                                        (lexicon hermeneus-lsj) &rest kwargs)
  "Read a Greek word from the LSJ, with Ivy completion.
COLLECTION should be a ‘hermeneus-lexicon’ object or a hash-table, and
defaults to the value of ‘hermeneus-lsj’. Any other arguments should be
keyword arguments, which are passed to ‘ivy-read’."
  (unless (fboundp 'ivy-read)
    (error "Ivy must be installed before using ‘counsel-greek-word’"))
  (let ((collection
         (cond ((hermeneus-lexicon-p lexicon)
                (hermeneus-get-entries lexicon))
               ((hash-table-p lexicon)
                lexicon)
               (t (error "Not a hermeneus-lexicon object or hash table: %s" lexicon)))))
    (cl-flet ((kw-put (prop val)
                      (unless (plist-member kwargs prop)
                        (cl-callf plist-put kwargs prop val))))
      (kw-put :action #'hermeneus--display-word-buffer)
      (kw-put :re-builder #'hermeneus--re-builder)
      (kw-put :matcher #'hermeneus--re-matcher)
      (awhen (hermeneus-greek-word-at-point)
        (kw-put :preselect it))
      (apply 'ivy-read prompt collection kwargs))))
#+end_src

** Get Greek letter equivalents
:PROPERTIES:
:ID:       TKR:9804b1a7-dae0-4425-b671-2cdc3b604017
:END:
#+begin_src emacs-lisp
(defun hermeneus--fold-case (string)
  (cl-loop for l across (regexp-quote string)
           if (memq l (string-to-list hermeneus--all-sigmas))
           concat (format "[%s]" hermeneus--all-sigmas)
           else
           concat (let ((upr (upcase l))
                        (lwr (downcase l)))
                    (if (eq upr lwr)
                        (char-to-string l)
                      (format "[%c%c]" upr lwr)))))
#+end_src

** Greek word at point
:PROPERTIES:
:ID:       TKR:3d941c67-20eb-4ad6-9653-bc545e109827
:END:
#+begin_src emacs-lisp
(defun hermeneus--bounds-of-chars (chars)
  "Skip CHARS backwards and forwards, return a cons of each point.
CHARS is a string containing the characters to skip over. If
point is not adjacent to any characters in CHARS, return nil."
  (let ((rtn (cons
              (save-excursion (skip-chars-backward chars)
                              (point))
              (save-excursion (skip-chars-forward chars)
                              (point)))))
    (unless (eql (car rtn) (cdr rtn))
      rtn)))

(defun hermeneus-bounds-of-greek-word-at-point ()
  (or (hermeneus--bounds-of-chars (concat hermeneus--greek-unicode-all
                                    hermeneus--greek-diacritics))
      (hermeneus--bounds-of-chars (concat hermeneus--beta-letters--user ; TODO should check user and standard variants
                                    hermeneus--beta-diacritics "*"))))

(defun hermeneus-greek-word-at-point ()
  (when-let ((bounds (hermeneus-bounds-of-greek-word-at-point))
             (word (buffer-substring-no-properties (car bounds) (cdr bounds)))
             (obj (hermeneus--string-to-object word hermeneus-lsj)))
    (oref obj key)))

(put (intern "greek-word") 'bounds-of-thing-at-point 'hermeneus-bounds-of-greek-word-at-point)
#+end_src

