hermeneus-xml.el
  "Access ‘entries’ slot of ‘hermeneus-lexicon’ object LEXICON.
The ‘entries’ slot of ‘hermeneus-lexicon’ objects is a hash table
containing ‘hermeneus-word’ objects. The reason to use this function
instead of using (oref LEXICON entries) is because a newly created
‘hermeneus-lexicon’ object will not have any ‘hermeneus-word’ objects in
its ‘entries’ slot, and will need to be populated."
  (unless (hermeneus-lexicon-p lexicon)
    (signal 'wrong-type-argument (list 'hermeneus-lexicon-p lexicon)))
  (unless (oref lexicon initialized-p)
    (hermeneus--populate-lexicon lexicon))
  (oref lexicon entries))

(defun hermeneus--populate-lexicon (lexicon)
  "Populate the ‘entries’ hash-table of ‘hermeneus-lexicon’ object LEXICON
with word-objects from the LSJ."
  (oset lexicon entries (hermeneus-scan-entries))
  (oset lexicon initialized-p t)
  (eieio-persistent-save lexicon))

;;;###autoload
(defun hermeneus-scan-lsj ()
  "Scan the LSJ and save the resulting word-objects to ‘hermeneus-lsj’."
  (interactive)
  (hermeneus--populate-lexicon hermeneus-lsj))

(provide 'hermeneus-xml)

;;; hermeneus-xml.el ends here
