hermeneus.org
** Look up Greek word noninteractively
:PROPERTIES:
:ID:       TKR:03304dde-533f-41bb-937b-99e3f31ef2f1
:END:
#+begin_src emacs-lisp
(cl-defun hermeneus--string-to-object (string &optional (lexicon hermeneus-lsj))
  "Retrieve the word-object in LEXICON corresponding to STRING.
The function ‘hermeneus--fuzzy-search’ is used when there isn’t an
exact match. If no result is found, return nil."
  (unless (and (stringp string) (hermeneus-lexicon-p lexicon))
    (error "Incorrect arguments for ‘hermeneus--string-to-object’: %s %s"
           string lexicon))
  (or (gethash string (hermeneus-get-entries lexicon))
      (hermeneus--fuzzy-search string)
      (hermeneus--fuzzy-search (string-trim string))
      (hermeneus--fuzzy-search (hermeneus--trim-string-extra string))))

(cl-defun hermeneus--fuzzy-search (string &optional (lexicon hermeneus-lsj))
  "Look up the word STRING in LEXICON (which defaults to the LSJ).
The functions ‘hermeneus--re-builder’ and ‘hermeneus--re-matcher’ are used to
provide fuzzy-matching. Returns a word-object."
  (let* ((hermeneus-beta-input-type 'beta)
         (re (hermeneus--re-builder string))
         (entries (hermeneus-get-entries lexicon))
         (matches (hermeneus--re-matcher re (hash-table-keys entries))))
    (when matches
      (gethash (car matches) entries))))
#+end_src

** Display word buffer
:PROPERTIES:
:ID:       TKR:bd16e1ce-fd2c-4c49-9a73-1d2038210079
:END:
#+begin_src emacs-lisp
(cl-defun hermeneus--display-word-buffer (word &optional (lexicon hermeneus-lsj))
  "Display WORD, a string or word-object, from LEXICON (default: LSJ)."
  (unless (hermeneus-word-p word)
    (if (stringp word)
        (setq word (hermeneus--string-to-object word lexicon))
      (error "Argument is neither a ‘hermeneus-word’ object nor a string: %s"
             word)))
  (when word
    (prog1 (hermeneus--switch-buffer
            (hermeneus--word-buffer word))
      (hermeneus--clear-old-buffers))))
#+end_src

** TODO Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:ca2a0940-f58e-4c15-9904-a0889f15eb36
:END:
#+begin_src emacs-lisp
(provide 'hermeneus-completion)

;;; hermeneus-completion.el ends here
#+end_src

* Canonical Text Services
:PROPERTIES:
:header-args:emacs-lisp: :tangle hermeneus-cts.el
:END:
Most of these code blocks do not tangle, because at present most of this section is stuff I used when manually generating ~hermeneus-abbr.el~ (which contains variables used when expanding abbreviations during the rendering of a lexicon entry). But, given that every work referenced in the LSJ has a Canonical Text Services URN, and the Scaife CTS API is emerging as the primary way to interact programmatically with the Perseus Project catalog of ancient works, I decided Hermeneus needed its own section for dealing with URNs, CTS, and whatnot.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-cts.el --- -*- lexical-binding: t -*-
#+end_src

** Variables
#+begin_src emacs-lisp
(defvar hermeneus-scaife-api-url "http://scaife-cts.perseus.org/api/cts"
  "The URL for the Perseus Project’s Scaife CTS API.")
#+end_src

** Functions
*** Convert URNs
#+begin_src emacs-lisp
(defun hermeneus-urn-to-base (urn)
  "Return URN with the passage component, if present, removed.
E.g., “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195” will be
returned as “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1”.
URN should be in the Canonical Text Services URN format. See
https://github.com/cite-architecture/ctsurn_spec/blob/master/md/specification.md"
  (save-match-data
    (if (and urn
             (string-match
              (rx (= 4 (one-or-more
                        (not (any control ":" "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                     ":"))
              urn))
        (substring urn 0 (1- (match-end 0)))
      urn)))

(defun hermeneus-urn-to-work (urn)
  "Return URN shortened to the work part of the work component.
E.g., “urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195” will be
returned as “urn:cts:greekLit:tlg0020.tlg001”.
URN should be in the Canonical Text Services URN format. See
https://github.com/cite-architecture/ctsurn_spec/blob/master/md/specification.md"
  (setq urn (hermeneus-urn-to-base urn))
  (save-match-data
    (if (and urn (string-match
                  (rx (= 3 (one-or-more
                            (not (any control ":" "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                         ":")
                      (= 2 (one-or-more
                            (not (any control "." "\\" "\"" "&" "<" ">" "^" "`" "|" "{" "}" "~")))
                         "."))
                  urn))
        (substring urn 0 (1- (match-end 0)))
      urn)))

(defun hermeneus-urn-to-url (urn &optional atom)
  "Return the canonical Perseus Catalog URL for URN.
If ATOM is non-nil, return the URL for the Atom version."
  (concat "http://data.perseus.org/catalog/" (hermeneus-urn-to-base urn)
          (when atom "/atom")))

#+end_src

*** Return all URNs in LSJ
#+begin_src emacs-lisp :tangle no :load no
(cl-defun hermeneus--get-all-urns (&optional (files hermeneus-lsj-files))
  (cl-loop with urns
           for file in files
           do (with-temp-buffer
                (insert-file-contents file)
                (goto-char 1)
                (save-match-data 
                  (while (re-search-forward
                          (rx "<bibl" word-end
                              (* (not ">"))
                              "n=\""
                              (group "urn:cts:"
                                     (* (not (any ":" ">")))
                                     ":"
                                     (* (not (any ":" ">" ".")))
                                     "."
                                     (* (not (any ":" ">" ".")))))
                          nil t)
                    (cl-pushnew (match-string 1) urns :test #'equal))))
           finally return (nreverse urns)))

(defvar hermeneus--all-urns (hermeneus--get-all-urns))

(cl-defun hermeneus--insert-all-urns (&optional (urns hermeneus--all-urns))
  (interactive)
  (cl-loop for urn in urns
           with add-newline-p
           initially do (insert "'(")
           do (insert "\"" urn "\"")
              (if add-newline-p
                  (progn (setq add-newline-p nil) (insert 10))
                (setq add-newline-p t)
                (insert " "))
           finally do (backward-delete-char 1)
              (insert ")")
              (save-buffer)))
#+end_src

*** Return title from URN
#+begin_src emacs-lisp :tangle no :results no
(require 'request)
(eval-when-compile (require 'subr-x))

(defun hermeneus--get-title-from-urn (urn)
  (let ((response
         (request-response-data
          (request hermeneus-scaife-api-url :params `((request . "GetLabel")
                                                (urn . ,urn))
                   :parser #'xml-parse-region
                   :sync t
                   :error #'ignore
                   :timeout 3))))
    (when response
      (thread-first response
        (dom-child-by-tag 'reply)
        (dom-child-by-tag 'label)
        (dom-child-by-tag 'title)
        (dom-text)))))

(cl-defun hermeneus--make-title-hash (&optional (urns hermeneus--all-urns))
  (cl-loop for urn in urns
           for title = (hermeneus--get-title-from-urn urn)
           with hash = (make-hash-table :test #'equal)
           if (not (string-blank-p title))
           do (puthash urn title hash)
           finally return hash))

(cl-defun hermeneus--insert-title-hash (&optional (urns hermeneus--all-urns)
                                            &aux (size 0) size-pos)
  (interactive)
  (insert "(defvar hermeneus-title-hash\n"
          "#s(hash-table size ")
  (setq size-pos (point))
  (insert " test equal rehash-size 1.5 rehash-threshold 0.8125 data\n(")
  (cl-loop for urn in urns
           for title = (hermeneus--get-title-from-urn urn)
           if (and title (not (string-blank-p title)))
           do (insert (format "%S %S\n" urn title))
              (setq size (1+ size)))
  (save-excursion
    (goto-char size-pos)
    (insert (format "%d" size)))
  (insert ")))"))


;; (hermeneus--get-title-from-urn (cadr hermeneus--all-urns))

;; (defvar hermeneus-title-hash (hermeneus--make-title-hash))
#+end_src

** TODO Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
(ert-deftest cts-test ()
  "Test the Canonical Test Services functionality."
  (should (equal (hermeneus-urn-to-base "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1"))
  (should (equal (hermeneus-urn-to-work "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "urn:cts:greekLit:tlg0020.tlg001"))
  (should (equal (hermeneus-urn-to-url "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "http://data.perseus.org/catalog/urn:cts:greekLit:tlg0020.tlg001.perseus-grc1")))
#+end_src

** End matter
#+begin_src emacs-lisp
(provide 'hermeneus-cts)

;;; hermeneus-cts.el ends here
#+end_src

* Tags
:PROPERTIES:
:header-args:emacs-lisp: :tangle hermeneus-tags.el
:END:
This handles all the many types of tags found in the XML version of the LSJ, how they are interpreted, rendered, etc. See ~define-hermeneus-tag~ in [[Macro for defining tags]] for information on how to make your own tag definitions.

** Front matter
#+begin_src emacs-lisp
;;; hermeneus-tags.el --- -*- lexical-binding: t -*-
#+end_src

** Dependencies
:PROPERTIES:
:ID:       TKR:ef24da1a-db83-4fa2-8e50-04ed115b256a
:END:
#+begin_src emacs-lisp
(require 'gv)
(require 'seq)
(require 'shr)
(require 'dom)

(eval-when-compile (require 'cl-macs)
                   (require 'subr-x))

(require 'hermeneus-xml)
(require 'hermeneus-conv)
(require 'hermeneus-render)
(require 'hermeneus-abbr) ; standalone file

(defvar hermeneus--greek-punctuation)
#+end_src

