hermeneus-completion.el

;; [[id:TKR:03304dde-533f-41bb-937b-99e3f31ef2f1][Look up Greek word noninteractively:1]]
(cl-defun hermeneus--string-to-object (string &optional (lexicon hermeneus-lsj))
  "Retrieve the word-object in LEXICON corresponding to STRING.
The function ‘hermeneus--fuzzy-search’ is used when there isn’t an exact
match. If no result is found, return nil."
  (unless (and (stringp string) (hermeneus-lexicon-p lexicon))
    (error "Incorrect arguments for ‘hermeneus--string-to-object’: %s %s"
           string lexicon))
  (or (gethash string (hermeneus-get-entries lexicon))
      (hermeneus--fuzzy-search string)
      (hermeneus--fuzzy-search (string-trim string))
      (hermeneus--fuzzy-search (hermeneus--trim-string-extra string))))

(cl-defun hermeneus--fuzzy-search (string &optional (lexicon hermeneus-lsj))
  "Look up the word STRING in LEXICON (which defaults to the LSJ).
The functions ‘hermeneus--re-builder’ and ‘hermeneus--re-matcher’ are used to
provide fuzzy-matching. Returns a word-object."
  (let* ((hermeneus-beta-input-type 'beta)
         (re (hermeneus--re-builder string))
         (entries (hermeneus-get-entries lexicon))
         (matches (hermeneus--re-matcher re (hash-table-keys entries))))
    (when matches
      (gethash (car matches) entries))))
;; Look up Greek word noninteractively:1 ends here

;; [[id:TKR:bd16e1ce-fd2c-4c49-9a73-1d2038210079][Display word buffer:1]]
(cl-defun hermeneus--display-word-buffer (word &optional (lexicon hermeneus-lsj))
  "Display WORD, a string or word-object, from LEXICON (default: LSJ)."
  (unless (hermeneus-word-p word)
    (if (stringp word)
        (setq word (hermeneus--string-to-object word lexicon))
      (error "Argument is neither a ‘hermeneus-word’ object nor a string: %s"
             word)))
  (when word
    (prog1 (hermeneus--switch-buffer
            (hermeneus--word-buffer word))
      (hermeneus--clear-old-buffers))))
;; Display word buffer:1 ends here

(provide 'hermeneus-completion)

;;; hermeneus-completion.el ends here
