hermeneus-tags.el
;;; hermeneus-tags.el --- -*- lexical-binding: t -*-

(require 'gv)
(require 'seq)
(require 'shr)
(require 'dom)

(eval-when-compile (require 'cl-macs)
                   (require 'subr-x))

(require 'hermeneus-xml)
(require 'hermeneus-conv)
(require 'hermeneus-render)
(require 'hermeneus-abbr) ; standalone file

(defvar hermeneus--greek-punctuation)
