hermeneus-test.el







(ert-deftest cts-test ()
  "Test the Canonical Test Services functionality."
  (should (equal (hermeneus-urn-to-base "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1"))
  (should (equal (hermeneus-urn-to-work "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "urn:cts:greekLit:tlg0020.tlg001"))
  (should (equal (hermeneus-urn-to-url "urn:cts:greekLit:tlg0020.tlg001.perseus-grc1:195")
                 "http://data.perseus.org/catalog/urn:cts:greekLit:tlg0020.tlg001.perseus-grc1")))
