hermeneus-tags.el

(defface hermeneus-default-face '((t nil))
  "Default face for Hermeneus text display."
  :tag "Hermeneus — default face"
  :group 'hermeneus-faces)

(defvar hermeneus-tei-tags '(foreign cit name abbr date pb bibl biblScope
                               title author entryFree sense gramGrp etym
                               orth pron gen number per tns mood itype pos
                               subc tr))

(defvar hermeneus--prev-tag nil)
(defvar hermeneus--prev-author nil)

(defvar hermeneus--bibl-urn nil
  "The CTS URN cited by the current bibl tag.
Should be nil if Hermeneus is not currently rendering a bibl tag.")

(defvar hermeneus-defined-tags nil)

(defvar hermeneus--tag-keywords '(:attrs :face :render :doc-source))

(defvar-local hermeneus--word-obj nil)
(defvar-local hermeneus--word-dom nil)

(defvar-local hermeneus-doc-source nil)

(defcustom hermeneus-expand-abbreviations t
  "Whether abbreviations in definitions should be expanded.
If non-nil, Hermeneus will attempt to expand abbreviations (of authors,
works, etc.) found when displaying a definition. The abbreviation will
be available as the ‘help-echo’ (“tooltip”) property of the expanded
text. If nil, abbreviations will remain, with expansions written as
‘help-echo’ properties."
  :type 'boolean
  :tag "Hermeneus — expand abbreviations"
  :group 'hermeneus)

(defun hermeneus--render-generic (dom &optional tag face)
  (unless tag
    (setq tag (dom-tag dom)))
  (unless face
    (setq face (intern-soft (format "hermeneus-face-%s" tag))))
  (hermeneus--insert-space-maybe)
  (shr-fontize-dom dom face)
  (setq hermeneus--prev-tag tag))

(defun hermeneus--insert-space-maybe ()
  (unless (or (bobp) (bolp)
              (let ((cs (char-syntax (char-before))))
                (or (eq cs 32) (eq cs ?\())))
    (shr-insert " ")))

(defun hermeneus-greek-word-button-action (button)
  (hermeneus--display-word-buffer (button-get button 'target)))

(define-button-type 'hermeneus-greek-word-button
  'action #'hermeneus-greek-word-button-action
  'target nil)
