hermeneus.org
** Tag definitions

*** Elements Available in All TEI Documents
:PROPERTIES:
:ID:       TKR:0cbf3bb6-a38b-4eb4-829e-72e1c51f596e
:END:
#+begin_src emacs-lisp :var hermeneus-doc-source='("https://tei-c.org/Vault/P4/doc/html/CO.html" "Elements Available in All TEI Documents")
(define-hermeneus-tag foreign
  "identifies a word or phrase as belonging to some language other than that of the surrounding text.")

(define-hermeneus-tag cit
  "A quotation from some other document, together with a bibliographic reference to its source.")

(define-hermeneus-tag name
  "contains a proper noun or noun phrase."
  :attrs
  type "indicates the type of the object which is being named by the phrase.")

(define-hermeneus-tag abbr
  "contains an abbreviation of any sort."
  :attrs
  expan "(expansion) gives an expansion of the abbreviation."
  resp "(responsibility) signifies the editor or transcriber responsible for supplying the expansion of the abbreviation held as the value of the expan attribute."
  type "allows the encoder to classify the abbreviation according to some convenient typology."
  cert "(certainty) signifies the degree of certainty ascribed to the expansion of the abbreviation.")

(define-hermeneus-tag date
  "contains a date in any format."
  :attrs
  calendar "indicates the system or calendar to which the date belongs."
  value "gives the value of the date in some standard form, usually yyyy-mm-dd."
  certainty "indicates the degree of precision to be attributed to the date.")

(define-hermeneus-tag pb
  "marks the boundary between one page of a text and the next in a standard reference system."
  :attrs
  ed "(edition) indicates the edition or version in which the page break is located at this point.")

(define-hermeneus-tag bibl
  "contains a loosely-structured bibliographic citation of which the sub-components may or may not be explicitly tagged."
  :render
  (let ((hermeneus--bibl-urn (hermeneus-urn-to-work (dom-attr dom 'n))))
    (hermeneus--render-generic dom)))

(define-hermeneus-tag biblScope
  "defines the scope of a bibliographic reference, for example as a list of pagenumbers, or a named subdivision of a larger work."
  :attrs
  type "identifies the type of information conveyed by the element, e.g. ‘pages’, ‘volume’.")

(define-hermeneus-tag title
  "contains the title of a work, whether article, book, journal, or series, including any alternative titles or subtitles."
  :attrs
  level "(bibliographic level (or class) of title) indicates whether this is the title of an article, book, journal, series, or unpublished material."
  type "(type of title) classifies the title according to some convenient typology."
  :render
  ;; a lot of this is copied from ‘author’ below; if anything else
  ;; copies this, refactoring may be in order
  (let* ((new-dom (copy-seq dom))
         (text (car (nthcdr (1- (safe-length new-dom)) new-dom)))
         (expansion (and (stringp text)
                         (gethash hermeneus--bibl-urn hermeneus-title-hash))))

    (when (and expansion hermeneus-expand-abbreviations)
      (setf (car (nthcdr (1- (safe-length new-dom)) new-dom)) expansion))

    (let ((start (point)))
      (hermeneus--render-generic new-dom)
      (when expansion
        (add-text-properties start (point)
                             (list 'help-echo
                                   (if hermeneus-expand-abbreviations
                                       text
                                     expansion)))))))

(define-hermeneus-tag author
  "in a bibliographic reference, contains the name of the author(s), personal or corporate, of a work; the primary statement of responsibility for any bibliographic item."
  :render
  (let* ((new-dom (copy-seq dom))
         (text (car (nthcdr (1- (safe-length new-dom)) new-dom)))
         (expansion (and (stringp text)
                         (gethash text hermeneus-author-abbr-hash))))

    (when (and expansion hermeneus-expand-abbreviations)
      (setf (car (nthcdr (1- (safe-length new-dom)) new-dom)) expansion))

    (let ((start (point)))
      (hermeneus--render-generic new-dom)
      (when expansion
        (add-text-properties start (point)
                             (list 'help-echo
                                   (if hermeneus-expand-abbreviations
                                       text
                                     expansion)))))))
#+end_src

