hermeneus.org
*** Print Dictionaries
:PROPERTIES:
:ID:       TKR:a805acf7-e2c2-4cfb-9911-2a8bb57eaccd
:END:
#+begin_src emacs-lisp :var hermeneus-doc-source='("https://tei-c.org/Vault/P4/doc/html/DI.html" "Print Dictionaries")
(define-hermeneus-tag entryFree
  "contains a dictionary entry which does not necessarily conform to the constraints imposed by the entry element."
  :render
  (let* ((key (dom-attr dom 'key))
         (id (dom-attr dom 'id))
         (heading (dom-node nil nil (hermeneus-beta-to-unicode key))))
    (shr-ensure-paragraph)
    (shr-heading heading 'info-title-3)
    (shr-fontize-dom dom 'hermeneus-face-entryFree)
    (shr-ensure-paragraph))
  (setq hermeneus--prev-tag 'entryFree))

(define-hermeneus-tag sense
  "groups together all information relating to one word sense in a dictionary entry (definitions, examples, translation equivalents, etc.)"
  :attrs
  level "gives the nesting depth of this sense."
  :render
  (shr-ensure-newline)
  (let ((start (point))
        (start-pixel (hermeneus--pixel-column)))
    (let* ((bullet (shr-insert (concat (dom-attr dom 'n) ". "))) ; bullet is inserted, here
           (width (- (hermeneus--pixel-column) start-pixel))
           (margin (* (string-to-number (dom-attr dom 'level))
                      (hermeneus--margin-indent-width))))
      (shr-mark-fill start)
      (put-text-property start (1+ start)
                         'shr-continuation-indentation margin)
      (put-text-property start (1+ start) 'shr-indentation (- margin width))
      (shr-fontize-dom dom 'hermeneus-face-sense)))
  (unless (bolp)
    (insert "\n"))
  (setq hermeneus--prev-tag 'sense))

(define-hermeneus-tag gramGrp
  "groups morpho-syntactic information about a lexical item, e.g. pos, gen, number, case, or itype (inflectional class).")

(define-hermeneus-tag etym
  "encloses the etymological information in a dictionary entry.")

(define-hermeneus-tag xr
  "contains a phrase, sentence, or icon referring the reader to some other location in this or another text."
  :attrs
  type "indicates the type of cross reference, using any convenient typology.")

(define-hermeneus-tag orth
  "gives the orthographic form of a dictionary headword."
  :attrs
  type "gives the type of spelling."
  extent "gives the extent of the orthographic information provided.")

(define-hermeneus-tag pron
  "contains the pronunciation(s) of the word."
  :attrs
  extent "indicates whether the pronunciation is for whole word or part.")

(define-hermeneus-tag lbl
  "in dictionaries, contains a label for a form, example, translation, or other piece of information, e.g. abbreviation for, contraction of, literally, approximately, synonyms:, etc."
  :attrs
  type "classifies the label using any convenient typology.")

(define-hermeneus-tag gen
  "identifies the morphological gender of a lexical item, as given in the dictionary.")

(define-hermeneus-tag number
  "indicates grammatical number associated with a form, as given in a dictionary.")

(define-hermeneus-tag per
  "contains an indication of the grammatical person (1st, 2nd, 3rd, etc.) associated with a given inflected form in a dictionary.")

(define-hermeneus-tag tns
  "indicates the grammatical tense associated with a given inflected form in a dictionary.")

(define-hermeneus-tag mood
  "contains information about the grammatical mood of verbs (e.g. indicative, subjunctive, imperative)")

(define-hermeneus-tag itype
  "indicates the inflectional class associated with a lexical item."
  :attrs
  type "indicates the type of indicator used to specify the inflection class, when it is necessary to distinguish between the usual abbreviated indications (e.g. ‘inv’) and other kinds of indicators, such as special codes referring to conjugation patterns, etc.")

(define-hermeneus-tag pos
  "Indicates the part of speech assigned to a dictionary headword (noun, verb, adjective, etc.)")

(define-hermeneus-tag subc
  "contains subcategorization information (transitive/intransitive, countable/non-countable, etc.)")

(define-hermeneus-tag tr
  "contains a translation of the headword or an example.")
#+end_src

*** Linking, Segmentation, and Alignment
:PROPERTIES:
:ID:       TKR:16b30fea-d72a-46ed-8d7b-3ad080969fd1
:END:
#+begin_src emacs-lisp :var hermeneus-doc-source='("https://tei-c.org/Vault/P4/doc/html/ND.html" "Linking, Segmentation, and Alignment")
(define-hermeneus-tag ref
  "defines a reference to another location in the current document, in terms of one or more identifiable elements, possibly modified by additional text or comment."
  :face
  '((t . (:inherit shr-link)))
  :render
  (if-let ((string1 (car (dom-strings dom)))
           
           ;; not sure how we will handle links to prefixes/suffixes,
           ;; so they are disabled for now
           ((not (string-prefix-p "-" (string-trim string1))))
           ((not (string-suffix-p "-" (string-trim string1))))
           
           (entries (hermeneus-get-entries hermeneus-lsj))
           (target (hermeneus--string-to-object string1)))
      (progn (hermeneus--insert-space-maybe)
             (let ((start (point)))
               (hermeneus--render-generic dom 'ref 'hermeneus-face-ref)
               (make-button start (point)
                            :type 'hermeneus-greek-word-button
                            'target target)))
    (hermeneus--render-generic dom 'ref 'hermeneus-default-face))
  :attrs
  target "specifies the destination of the reference by supplying the value of the id attribute on one or more other elements in the current document."
  type "categorizes the pointer in some respect, using any convenient set of categories.
Values: The type should indicate the intended function of the pointer, or the rhetorical relationship between its source and the target.
Default: #IMPLIED"
  resp "specifies the creator of the pointer.
Values: any string of characters, usually the initials or name of the creator.
Default: #IMPLIED"
  crdate "specifies when the pointer was created.
Values: A date in ISO 8601 format, generally yyyy-mm-dd.
Default: #IMPLIED"
  targType "specifies the kinds of elements to which this pointer may point.
Values: A list of valid element names declared in the DTD of the current document.
Default: #IMPLIED
Note: If this attribute is supplied, every element specified as a target must be of one or other of the types specified. An application may choose whether or not to report failures to satisfy this constraint as errors, but may not access an element of the right identifier but the wrong type."
  targOrder "where more than one identifier is supplied as the value of the target attribute, this attribute specifies whether the order in which they are supplied is significant.
Legal values are:
Y	Yes: the order in which IDREF values are specified as the value of a target attribute should be followed when combining the targeted elements.
N	No: the order in which IDREF values are specified as the value of a target attribute has no significance when combining the targeted elements.
U	Unspecified: the order in which IDREF values are specified as the value of a target attribute may or may not be significant.
Default: U"
  evaluate "specifies the intended meaning when the target of a pointer is itself a pointer.
Legal values are:
all	if the element pointed to is itself a pointer, then the target of that pointer will be taken, and so on, until an element is found which is not a pointer.
one	if the element pointed to is itself a pointer, then its target (whether a pointer or not) is taken as the target of this pointer.
none	no further evaluation of targets is carried out beyond that needed to find the element specified in the pointer's target.
Default: #IMPLIED
Note: If no value is given, the application program is responsible for deciding (possibly on the basis of user input) how far to trace a chain of pointers.")
#+end_src

*** Names and Dates
:PROPERTIES:
:ID:       TKR:87ee579a-cc46-4178-ab45-82a5c9cf108d
:END:
#+begin_src emacs-lisp :var hermeneus-doc-source='("https://tei-c.org/Vault/P4/doc/html/ND.html" "Names and Dates")
(define-hermeneus-tag placeName
  "contains an absolute or relative place name.")
#+end_src

