hermeneus-render.el
;;; hermeneus-render.el --- -*- lexical-binding: t -*-

;; [[id:TKR:aad6b242-9100-4505-9739-dbcfc187c036][Dependencies:1]]
(require 'gv)
(require 'widget)
(require 'tree-widget)
(require 'anaphora)
(require 'shr)
(require 'dom)
(require 'hermeneus-xml)
(require 'eieio)
(require 'seq)

(eval-when-compile (require 'cl-macs)
                   (require 'rx)
                   (require 'subr-x))

(require 'hermeneus-conv)
(require 'hermeneus-xml)
(require 'hermeneus-tags)

(defvar hermeneus--greek-punctuation)
;; Dependencies:1 ends here

;; [[id:TKR:6cfdaa3c-43a4-4acc-ac6f-ec4c0f33091c][Variables:1]]
(defcustom hermeneus-max-buffers 8
  "The maximum number of open Hermeneus word buffers.
If there are this many buffers open, then opening a new Hermeneus word
buffer will close the least recently visited one. Nil means no Hermeneus
buffers will be closed upon opening a new one.

(Note that quitting such a buffer with ‘quit-window’, ordinarily set to
the letter q, will send it to the back of the line; i.e., it will be
first to be closed when opening a new word buffer.)"
  :type '(choice (const nil) integer)
  :tag "Hermeneus — maximum number of buffers"
  :group 'hermeneus)

(defcustom hermeneus-show-entry-source nil
  "Whether to show the document source after a word definition.
This affects the word defintiions displayed by ‘describe-greek-word’ and
‘counsel-greek-word’.

When this is set to “XML” (symbol ‘xml’), then any definition displayed
will be followed by the definition’s original XML source. When this is
set to “DOM sexp” (symbol ‘sexp’), the source will be displayed in the
form of the DOM sexp that was generated from the XML by
‘libxml-parse-xml-region’ and used by Hermeneus to interpret and render
the definition. When this is set to “both” (symbol ‘both’, or t), then
the source will be displayed as XML and as a DOM sexp. When this is set
to “no” (nil), the default, then no source will be displayed below the
definition."
  :type '(choice (const xml :tag "XML")
                 (const sexp :tag "DOM sexp")
                 (const both :tag "both")
                 (const nil :tag "no"))
  :tag "Hermeneus — show entry source?"
  :group 'hermeneus)

(defcustom hermeneus-show-entry-source-tidy-p t
  "Whether to tidy the displayed XML source using Tidy.
Tidy is an external program that makes XML sources easier to
read. If it is not installed, or if “Hermeneus — show entry
source?” (‘hermeneus-show-entry-source-p’) is nil, this option is
ignored.

Find out more about Tidy at http://www.html-tidy.org"
  :type 'boolean
  :tag "Hermeneus — tidy entry source?"
  :group 'hermeneus)

(defcustom hermeneus-show-entry-source-tidy-config
  (expand-file-name "hermeneus-tidy.conf" (file-name-directory
                                     (locate-library "hermeneus")))
  "Configuration file to use with Tidy when tidying XML sources.
See options “Hermeneus — show entry source?”
(‘hermeneus-show-entry-source-p’) and “Hermeneus — tidy entry source?”
(‘hermeneus-show-entry-source-tidy’).

Find out more about Tidy at http://www.html-tidy.org"
  :type 'file
  :tag "Hermeneus — Tidy config file"
  :group 'hermeneus)
;; Variables:1 ends here

;; [[id:TKR:40231884-7d27-4fa7-a8a5-52bbab041a20][Functions:1]]
(defun hermeneus--roman-numeral-p (string)
  "A limited test for whether STRING represents a Roman numeral.
This is to allow proper spacing for Roman-numbered list bullets. The
limitation is that it can’t tell when a single letter (“I”, “V”, “X”,
etc.) is supposed to be a Roman numeral or not, and in those cases it
will return nil."
  (when (> (length string) 1)
    (string-match-p "\\`M?M?M?C?M?D?C?C?C?D?C?X?C?L?X?L?X?X?X?I?X?V?I?V?I?I?I?\\'" string)))

(defun hermeneus--margin-indent-width ()
  ;; The contents of this function used to be as follows:
  ;; (shr-string-pixel-width
  ;;  (propertize "XIII " :face 'hermeneus-default-face))
  ;; Sometime after I upgraded to Emacs 29, this started giving me an
  ;; error, saying that ‘shr-string-pixel-width’ is an invalid
  ;; function (it’s a macro). I’m not sure why this happens. But,
  ;; ‘shr-string-pixel-width’ is a pretty simple macro, so I’m
  ;; just reimplementing its functionality here.
  (let ((string (propertize "XIII " :face 'hermeneus-default-face)))
    (if (not shr-use-fonts)
        (length string)
      (string-pixel-width string))))

(defun hermeneus--pixel-column ()
  (let ((pos (point)))
    (prog1 (shr-pixel-column)
      (goto-char pos))))
;; Functions:1 ends here
