hermeneus-render.el

;; [[id:TKR:8fcb947d-de04-41e0-9bd4-c9861511da2b][Widgets:1]]
(defvar hermeneus--tree-depth 0)
(defvar hermeneus--parent-tree nil)

(define-widget 'hermeneus-tree-widget 'tree-widget
  "A tree widget for displaying XML sources and DOM trees."
  :action 'hermeneus-tree-widget-action
  :expander 'hermeneus-tree-widget-expander)

(defun hermeneus--tree-icon-width (&optional icon-sym)
  (with-temp-buffer
    (widget-create (or icon-sym 'tree-widget-open-icon))
    (hermeneus--pixel-column)))

(defun hermeneus--get-dom-tree-widget (value &rest kwargs)
  (if (consp value)
      `(hermeneus-tree-widget :tag ,(when-let ((tag (dom-tag value)))
                                (propertize (symbol-name (dom-tag value))
                                            'face 'bold))
                        :hermeneus-value ,value
                        ,@kwargs)
    `(item :value ,(propertize (format "\"%s\"" value)
                               'hermeneus--tree hermeneus--parent-tree
                               'face 'font-lock-string-face))))

(defun hermeneus-tree-widget-expander (tree)
  (let* ((value (widget-get tree :hermeneus-value))
         (attrs-string (awhen (dom-attributes value)
                         (thread-first it
                           (pp-to-string)
                           (string-trim-right)
                           (propertize 'hermeneus--tree tree)))))
    (append (when attrs-string
              `((item :value ,attrs-string)))
            (awhen (dom-children value)
              (let ((hermeneus--parent-tree tree))
                (cl-loop for c in it
                         for i from (length it) downto 1
                         if (or (> i 1) (not (stringp c)))
                         collect (hermeneus--get-dom-tree-widget c)
                         else
                         collect (hermeneus--get-dom-tree-widget
                                  (propertize
                                   c 'hermeneus--tree-last-sibling t))))))))

(defun hermeneus-tree-widget-action (tree &optional event)
  (unwind-protect
      (progn
        (advice-add 'princ :before-until 'hermeneus--well-excuse-me-princ)
        (tree-widget-action tree event))
    (advice-remove 'princ 'hermeneus--well-excuse-me-princ)))

(defun hermeneus--tree-insert-guides (tree &optional icon-width last-sibling-p)
  (let ((flags    (aif (widget-get tree :tree-widget--guide-flags)
                      (append (list t) it)
                    (if last-sibling-p
                        (list nil)
                      (list t))))
        (guide    (widget-get tree :guide))
        (noguide  (widget-get tree :no-guide))
        (guidi    (tree-widget-find-image "guide"))
        (noguidi  (tree-widget-find-image "no-guide"))
        (nohandle (widget-get tree :no-handle))
        (nohandli (tree-widget-find-image "no-handle")))
    ;; From ‘tree-widget.el’.
    (dolist (f (reverse flags))
      (widget-create-child-and-convert
       tree (if f guide noguide)
       :tag-glyph (if f guidi noguidi))
      (widget-create-child-and-convert
       tree nohandle :tag-glyph nohandli))
    (insert (propertize " " 'display
                        `(space :width (,(or icon-width
                                             (hermeneus--tree-icon-width))))))))

(defun hermeneus--well-excuse-me-princ (object &optional printcharfun)
  "Function with which to override ‘princ’ to preserve text properties.
Well excu-u-u-u-use me, ‘princ’!"
  ;; This function is meant to be used as ‘before-until’ advice.
  (when (and (stringp object) (bufferp printcharfun))
    (when-let ((tree (get-text-property 0 'hermeneus--tree object))
               (wrap (with-temp-buffer
                       (hermeneus--tree-insert-guides tree)
                       (hermeneus--pixel-column))))
      (cl-callf propertize object 'wrap-prefix `(space :width (,wrap)))
      (if-let ((first-line-end (string-match-p "\n" object))
               (first-line     (substring object 0 (1+ first-line-end)))
               (rest-lines     (substring object (1+ first-line-end)))
               (icon-width     (hermeneus--tree-icon-width)))
          (let ((last-sibling-p (get-text-property 1 'hermeneus--tree-last-sibling object)))
            (with-current-buffer printcharfun
              (insert first-line)
              (dolist (l (split-string rest-lines "\n"))
                (hermeneus--tree-insert-guides tree icon-width last-sibling-p)
                (insert l ?\n))
              (delete-char -1)))
        (insert object))
      object)))
;; Widgets:1 ends here

;; [[id:TKR:fc1834d0-b144-4892-88ba-59ce73dd836d][Help buffers:1]]
(defun hermeneus--word-buffer (obj)
  "Get or create a Hermeneus buffer for word-object OBJ and return it."
  (with-current-buffer (get-buffer-create (format "*Hermeneus: %s *" (oref obj key)))
    (hermeneus-mode)
    (setq hermeneus--word-obj obj
          hermeneus--word-dom (hermeneus--get-dom-from-word obj))
    (hermeneus--dom-convert-betacode hermeneus--word-dom)
    (hermeneus-buffer-update)
    (current-buffer)))

(defun hermeneus--dom-convert-betacode (dom)
  "Destructively convert all Greek Betacode text in DOM to Unicode."
  (cl-loop for elt in-ref (dom-elements dom 'lang "greek")
           do (cl-loop for child in-ref (dom-children elt)
                       if (and (stringp child)
                               (not (string-match-p
                                     (rx (category greek)) child)))
                       do (cl-callf hermeneus-beta-to-unicode child))))

(defun hermeneus--get-rendering-functions-alist ()
  (cl-loop for tag in hermeneus-defined-tags
           collect (cons tag (intern-soft (format "hermeneus-render-%s" tag)))))

(defun hermeneus-buffer-update ()
  (interactive)
  (let ((shr-external-rendering-functions
         (hermeneus--get-rendering-functions-alist))
        (inhibit-read-only t)
        (pos (point)))
    (with-silent-modifications
      (erase-buffer)
      (shr-insert-document hermeneus--word-dom)
      (when hermeneus-show-entry-source
        (insert "\n══════════════════════╡ Source ╞══════════════════════\n\n")
        (when (memq hermeneus-show-entry-source '(xml both t))
          (let ((widget `(hermeneus-tree-widget :tag "XML source")))
            (widget-put widget :args `((item :value ,(propertize
                                                      (hermeneus--get-entry-source hermeneus--word-obj)
                                                      'hermeneus--tree widget
                                                      'hermeneus--tree-last-sibling t))))
            (widget-create widget)))
        (when (memq hermeneus-show-entry-source '(sexp both t))
          (widget-create
           `(hermeneus-tree-widget :tag "DOM tree"
                             :hermeneus-value ,hermeneus--word-dom))))
      (goto-char pos))))
;; Help buffers:1 ends here

;; [[id:TKR:2c8fd835-90e1-4e54-a923-2da89407f579][Switch buffer:1]]
(defun hermeneus--switch-buffer (buffer)
  ;; Is the current window a Hermeneus buffer? Switch in the same window.
  (if (eq major-mode 'hermeneus-mode)
      (pop-to-buffer-same-window buffer)
    ;; Is any window on the current frame a Hermeneus buffer? Switch
    ;; in that window.
    (if-let ((window (cl-loop for x in (window-list)
                              if (eq (with-selected-window x major-mode)
                                     'hermeneus-mode)
                              return x)))
        (progn (select-window window) (pop-to-buffer-same-window buffer))
      ;; Otherwise, use ‘pop-to-buffer’.
      (pop-to-buffer buffer))))
;; Switch buffer:1 ends here
