hermeneus.org
*** Get entry source
:PROPERTIES:
:ID:       TKR:2e7d2ea0-72e2-4903-80ac-2ac3f2980f71
:END:
#+begin_src emacs-lisp
(cl-defun hermeneus--get-entry-source (&optional (obj hermeneus--word-obj))
  (seq-let (i begin end) (oref obj loc)
    (let ((bufstr (hermeneus--get-dom-from-file i begin end :plain-xml-p t)))
      (with-temp-buffer
        (insert bufstr)
        (hermeneus-tidy-xml-buffer)
        (hermeneus-indent-xml-buffer)
        ;; fontify the source—thanks go to Wilfred Hughes’s
        ;; ‘helpful’ package for a good example of how to do this
        ;; (in function ‘helpful--syntax-highlight’)
        (delay-mode-hooks
          (if (fboundp 'xml-mode)
              (nxml-mode)
            (xml-mode)))
        (if (fboundp 'font-lock-ensure)
            (font-lock-ensure)
          (with-no-warnings
            (font-lock-fontify-buffer)))
        (buffer-string)))))

;; (cl-defun hermeneus--get-entry-sexp (&optional (obj hermeneus--word-obj))
;;   (seq-let (i begin end) (oref obj loc)
;;     (let ((bufstr (hermeneus--get-dom-from-file i begin end)))
;;       (with-temp-buffer
;;         (pp bufstr (current-buffer))
;;         (delay-mode-hooks (emacs-lisp-mode))
;;         (when (fboundp 'rainbow-delimiters-mode)
;;           (rainbow-delimiters-mode))
;;         (if (fboundp 'font-lock-ensure)
;;             (font-lock-ensure)
;;           (with-no-warnings
;;             (font-lock-fontify-buffer)))
;;         (buffer-string)))))
#+end_src

*** Tidying
:PROPERTIES:
:ID:       TKR:4d3df8d9-777d-4421-ad3a-a10912a34890
:END:
#+begin_src emacs-lisp
(defun hermeneus-tidy-xml-buffer ()
  (interactive)
  (if (and hermeneus-show-entry-source-tidy-p (executable-find "tidy"))
      (call-process-region 1 (point-max) "tidy" t t nil
                           "-config" hermeneus-show-entry-source-tidy-config "-")))

(defun hermeneus-indent-xml-buffer ()
  (interactive)
  ;; Tidy and ‘nxml-mode’ both royally fail at
  ;; indenting the LSJ’s XML properly, so we’ll
  ;; press ‘sgml-mode’ into service.
  (when (fboundp 'sgml-mode)
    (let ((mode major-mode))
      (delay-mode-hooks (sgml-mode))
      (goto-char (point-min))
      (while (< (point) (point-max))
        (sgml-indent-line)
        (forward-line))
      (funcall mode))))
#+end_src

*** Clear out old Hermeneus buffers
#+begin_src emacs-lisp
(defun hermeneus--clear-old-buffers ()
  "Clear out old Hermeneus buffers to satisfy ‘hermeneus-max-buffers’."
  ;; with acknowledgement to Wilfred Hughes’s ‘helpful’ package
  ;; and the function ‘helpful--buffer’
  (when (numberp hermeneus-max-buffers)
    (let* ((hermeneus-buffers
            (seq-filter (lambda (x) (with-current-buffer x
                                      (eq major-mode 'hermeneus-mode)))
                        (buffer-list)))
           ;; The result of the function ‘buffer-list’ is ordered by
           ;; most recently visited first; so, define everything past
           ;; the ‘hermeneus-max-buffers’ limit as excess
           (excess-buffers (nthcdr hermeneus-max-buffers hermeneus-buffers)))
      (mapc #'kill-buffer excess-buffers))))
#+end_src

** TODO Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
#+end_src

** End matter
:PROPERTIES:
:ID:       TKR:62892e62-3cf5-4ebb-8622-83ad6021d9d3
:END:
#+begin_src emacs-lisp
(provide 'hermeneus-render)

;;; hermeneus-render.el ends here
#+end_src

* End matter
:PROPERTIES:
:ID:       TKR:ea04e9be-aeef-48ed-88eb-f885d3304129
:END:
#+begin_src emacs-lisp
(require 'hermeneus-conv)
(require 'hermeneus-match)
(require 'hermeneus-xml)
(require 'hermeneus-completion)
(require 'hermeneus-storage)
(require 'hermeneus-cts)
(require 'hermeneus-tags)
(require 'hermeneus-render)

(provide 'hermeneus)

;;; hermeneus.el ends here
#+end_src

** Testing
#+begin_src emacs-lisp :tangle "hermeneus-test.el"
;;; hermeneus-test.el ends here
#+end_src
