hermeneus-render.el

;; [[id:TKR:2e7d2ea0-72e2-4903-80ac-2ac3f2980f71][Get entry source:1]]
(cl-defun hermeneus--get-entry-source (&optional (obj hermeneus--word-obj))
  (seq-let (i begin end) (oref obj loc)
    (let ((bufstr (hermeneus--get-dom-from-file i begin end :plain-xml-p t)))
      (with-temp-buffer
        (insert bufstr)
        (hermeneus-tidy-xml-buffer)
        (hermeneus-indent-xml-buffer)
        ;; fontify the source—thanks go to Wilfred Hughes’s ‘helpful’
        ;; package for a good example of how to do this (in function
        ;; ‘helpful--syntax-highlight’)
        (delay-mode-hooks
          (if (fboundp 'xml-mode)
              (nxml-mode)
            (xml-mode)))
        (if (fboundp 'font-lock-ensure)
            (font-lock-ensure)
          (with-no-warnings
            (font-lock-fontify-buffer)))
        (buffer-string)))))

;; (cl-defun hermeneus--get-entry-sexp (&optional (obj hermeneus--word-obj))
;;   (seq-let (i begin end) (oref obj loc)
;;     (let ((bufstr (hermeneus--get-dom-from-file i begin end)))
;;       (with-temp-buffer
;;         (pp bufstr (current-buffer))
;;         (delay-mode-hooks (emacs-lisp-mode))
;;         (when (fboundp 'rainbow-delimiters-mode)
;;           (rainbow-delimiters-mode))
;;         (if (fboundp 'font-lock-ensure)
;;             (font-lock-ensure)
;;           (with-no-warnings
;;             (font-lock-fontify-buffer)))
;;         (buffer-string)))))
;; Get entry source:1 ends here

;; [[id:TKR:4d3df8d9-777d-4421-ad3a-a10912a34890][Tidying:1]]
(defun hermeneus-tidy-xml-buffer ()
  (interactive)
  (if (and hermeneus-show-entry-source-tidy-p (executable-find "tidy"))
      (call-process-region 1 (point-max) "tidy" t t nil
                           "-config" hermeneus-show-entry-source-tidy-config "-")))

(defun hermeneus-indent-xml-buffer ()
  (interactive)
  ;; Tidy and ‘nxml-mode’ both royally fail at
  ;; indenting the LSJ’s XML properly, so we’ll
  ;; press ‘sgml-mode’ into service.
  (when (fboundp 'sgml-mode)
    (let ((mode major-mode))
      (delay-mode-hooks (sgml-mode))
      (goto-char (point-min))
      (while (< (point) (point-max))
        (sgml-indent-line)
        (forward-line))
      (funcall mode))))
;; Tidying:1 ends here

;; [[id:TKR:1b45d816-5cc7-441a-b9cb-70863a09ba98][Clear out old Hermeneus buffers:1]]
(defun hermeneus--clear-old-buffers ()
  "Clear out old Hermeneus buffers to satisfy ‘hermeneus-max-buffers’."
  ;; with acknowledgement to Wilfred Hughes’s ‘helpful’ package
  ;; and the function ‘helpful--buffer’
  (when (numberp hermeneus-max-buffers)
    (let* ((hermeneus-buffers
            (seq-filter (lambda (x) (with-current-buffer x
                                      (eq major-mode 'hermeneus-mode)))
                        (buffer-list)))
           ;; The result of the function ‘buffer-list’ is ordered by
           ;; most recently visited first; so, define everything past
           ;; the ‘hermeneus-max-buffers’ limit as excess
           (excess-buffers (nthcdr hermeneus-max-buffers hermeneus-buffers)))
      (mapc #'kill-buffer excess-buffers))))
;; Clear out old Hermeneus buffers:1 ends here

(provide 'hermeneus-render)

;;; hermeneus-render.el ends here
